```terraform
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # opentelekomcloud_dns_recordset_v2.app_fqdn will be created
  + resource "opentelekomcloud_dns_recordset_v2" "app_fqdn" {
      + description = "CCE Grafana access FQDN"
      + id          = (known after apply)
      + name        = "obs2.sdombi.hu."
      + records     = (known after apply)
      + region      = (known after apply)
      + shared      = false
      + ttl         = 300
      + type        = "A"
      + zone_id     = "2c9c2de9821a9855018c69aae5a31093"
    }

  # opentelekomcloud_identity_credential_v3.this will be created
  + resource "opentelekomcloud_identity_credential_v3" "this" {
      + access          = (sensitive value)
      + create_time     = (known after apply)
      + description     = "created by terraform"
      + id              = (known after apply)
      + key_fingerprint = (known after apply)
      + last_use_time   = (known after apply)
      + secret          = (sensitive value)
      + status          = (known after apply)
      + user_id         = (known after apply)
    }

  # opentelekomcloud_identity_group_v3.this will be created
  + resource "opentelekomcloud_identity_group_v3" "this" {
      + description = "Loki RBAC for logging stack, managed by terraform"
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "sdombi-loki2obs-eu-de"
      + region      = (known after apply)
    }

  # opentelekomcloud_identity_role_assignment_v3.this will be created
  + resource "opentelekomcloud_identity_role_assignment_v3" "this" {
      + all_projects = true
      + domain_id    = "9702f6e052f64ad6bc7dcdfca44d518e"
      + group_id     = (known after apply)
      + id           = (known after apply)
      + role_id      = (known after apply)
    }

  # opentelekomcloud_identity_role_assignment_v3.this_kms will be created
  + resource "opentelekomcloud_identity_role_assignment_v3" "this_kms" {
      + all_projects = true
      + domain_id    = "9702f6e052f64ad6bc7dcdfca44d518e"
      + group_id     = (known after apply)
      + id           = (known after apply)
      + role_id      = (known after apply)
    }

  # opentelekomcloud_identity_role_v3.this_kms will be created
  + resource "opentelekomcloud_identity_role_v3" "this_kms" {
      + catalog       = (known after apply)
      + description   = "loki role to allow kms access"
      + display_layer = "project"
      + display_name  = "sdombi-loki_role_kms-eu-de"
      + domain_id     = (known after apply)
      + id            = (known after apply)
      + name          = (known after apply)

      + statement {
          + action = [
              + "kms:cmk:list",
              + "kms:cmk:get",
            ]
          + effect = "Allow"
        }
      + statement {
          + action   = [
              + "kms:cmk:generate",
              + "kms:dek:create",
              + "kms:cmk:crypto",
              + "kms:dek:crypto",
            ]
          + effect   = "Allow"
          + resource = (known after apply)
        }
    }

  # opentelekomcloud_identity_role_v3.this_obs will be created
  + resource "opentelekomcloud_identity_role_v3" "this_obs" {
      + catalog       = (known after apply)
      + description   = "loki role to allow obs access"
      + display_layer = "domain"
      + display_name  = "sdombi-loki_role_obs-eu-de"
      + domain_id     = (known after apply)
      + id            = (known after apply)
      + name          = (known after apply)

      + statement {
          + action   = [
              + "obs:object:DeleteObject",
              + "obs:object:PutObject",
              + "obs:object:GetObject",
              + "obs:bucket:ListBucket",
              + "obs:bucket:GetEncryptionConfiguration",
            ]
          + effect   = "Allow"
          + resource = (known after apply)
        }
    }

  # opentelekomcloud_identity_user_group_membership_v3.this will be created
  + resource "opentelekomcloud_identity_user_group_membership_v3" "this" {
      + groups = (known after apply)
      + id     = (known after apply)
      + user   = (known after apply)
    }

  # opentelekomcloud_identity_user_v3.this will be created
  + resource "opentelekomcloud_identity_user_v3" "this" {
      + access_type       = "programmatic"
      + create_time       = (known after apply)
      + description       = "Loki RBAC for logging stack, managed by terraform"
      + domain_id         = (known after apply)
      + email             = (known after apply)
      + enabled           = true
      + id                = (known after apply)
      + last_login        = (known after apply)
      + name              = "sdombi-loki2obs-eu-de"
      + password_strength = (known after apply)
      + pwd_reset         = true
    }

  # opentelekomcloud_kms_key_v1.this will be created
  + resource "opentelekomcloud_kms_key_v1" "this" {
      + creation_date           = (known after apply)
      + default_key_flag        = (known after apply)
      + domain_id               = (known after apply)
      + expiration_time         = (known after apply)
      + id                      = (known after apply)
      + is_enabled              = true
      + key_alias               = (known after apply)
      + key_description         = "KMS key for loki chunks bucket"
      + origin                  = (known after apply)
      + pending_days            = "7"
      + realm                   = "eu-de"
      + rotation_interval       = (known after apply)
      + rotation_number         = (known after apply)
      + scheduled_deletion_date = (known after apply)
    }

  # opentelekomcloud_lb_loadbalancer_v3.elb will be created
  + resource "opentelekomcloud_lb_loadbalancer_v3" "elb" {
      + admin_state_up      = true
      + availability_zones  = [
          + "eu-de-01",
        ]
      + created_at          = (known after apply)
      + deletion_protection = (known after apply)
      + id                  = (known after apply)
      + ip_target_enable    = (known after apply)
      + l4_flavor           = (known after apply)
      + l7_flavor           = "4e3f64bb-96d5-4713-9d1c-48752b93012f"
      + name                = "cce-grafana-elb"
      + network_ids         = [
          + "418bba3c-cb14-490d-9177-9b9c5ad3186e",
        ]
      + router_id           = "36a075cc-a2b0-41a3-95f4-66eaaccde363"
      + updated_at          = (known after apply)
      + vip_address         = (known after apply)
      + vip_port_id         = (known after apply)

      + public_ip {
          + _managed              = (known after apply)
          + address               = (known after apply)
          + bandwidth_charge_mode = "traffic"
          + bandwidth_name        = (known after apply)
          + bandwidth_share_type  = (known after apply)
          + bandwidth_size        = (known after apply)
          + id                    = (known after apply)
          + ip_type               = (known after apply)
        }
    }

  # opentelekomcloud_obs_bucket.this will be created
  + resource "opentelekomcloud_obs_bucket" "this" {
      + acl                = "private"
      + bucket             = "sdombi-logs"
      + bucket_domain_name = (known after apply)
      + bucket_version     = (known after apply)
      + force_destroy      = true
      + id                 = (known after apply)
      + region             = "eu-de"
      + storage_class      = "STANDARD"
      + user_domain_names  = (known after apply)
      + versioning         = false

      + lifecycle_rule {
          + enabled = true
          + name    = "index"
          + prefix  = "index/"

          + expiration {
              + days = 100
            }
        }

      + server_side_encryption {
          + algorithm  = "kms"
          + kms_key_id = (known after apply)
        }
    }

  # opentelekomcloud_vpc_eip_v1.elb_eip will be created
  + resource "opentelekomcloud_vpc_eip_v1" "elb_eip" {
      + id     = (known after apply)
      + region = (known after apply)

      + bandwidth {
          + charge_mode = "traffic"
          + name        = "cce-grafana-eip-bandwidth"
          + share_type  = "PER"
          + size        = 5
        }

      + publicip {
          + ip_address = (known after apply)
          + name       = (known after apply)
          + port_id    = (known after apply)
          + type       = "5_bgp"
        }
    }

  # random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```